data/WS-Addressing/ws-addressing-5.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:f6e5f175-3935-49d9-9e18-36b9b4bbd4bd</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address><ReferenceParameters><ck:CustomerKey xmlns:ck="http://example.org/customer">Key#123456789</ck:CustomerKey></ReferenceParameters></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1106</notify></S:Body></S:Envelope>